In [3]:
import numpy as np
import pandas as pd



df = pd.read_csv('/Users/malaikahkhan/Desktop/Fall 2025/SQL/grocery_chain_data.csv')
df.head()

,customer_id,store_name,transaction_date,aisle,product_name,quantity,unit_price,total_amount,discount_amount,final_amount,loyalty_points
0,2824,GreenGrocer Plaza,2023-08-26,Produce,Pasta,2.0,7.46,14.92,0.00,14.92,377
1,5506,ValuePlus Market,2024-02-13,Dairy,Cheese,1.0,1.85,1.85,3.41,-1.56,111
2,4657,ValuePlus Market,2023-11-23,Bakery,Onions,4.0,7.38,29.52,4.04,25.48,301
3,2679,SuperSave Central,2025-01-13,Snacks & Candy,Cereal,3.0,5.50,16.50,1.37,15.13,490
4,9935,GreenGrocer Plaza,2023-10-13,Canned Goods,Orange Juice,5.0,8.66,43.30,1.50,41.80,22

In [4]:
print(df["store_name"].unique())

['GreenGrocer Plaza' 'ValuePlus Market' 'SuperSave Central'
 'Corner Grocery' 'City Fresh Store' 'QuickStop Market'
 'FreshMart Downtown' 'MegaMart Westside' 'FamilyFood Express' nan]

In [5]:
import numpy as np
import pandas as pd

#manipulating dataset only 5 stores to fit our scenario 
valid_stores = [
    "GreenGrocer Plaza",
    "ValuePlus Market",
    "Corner Grocery",
    "FreshMart Downtown",
    "MegaMart Westside"
]


df['store_name'] = df['store_name'].fillna(np.random.choice(valid_stores))

# replacing each row with 1 of 5 stores 
df['store_name'] = df['store_name'].apply(lambda x: np.random.choice(valid_stores))

In [6]:
df.head()

,customer_id,store_name,transaction_date,aisle,product_name,quantity,unit_price,total_amount,discount_amount,final_amount,loyalty_points
0,2824,FreshMart Downtown,2023-08-26,Produce,Pasta,2.0,7.46,14.92,0.00,14.92,377
1,5506,FreshMart Downtown,2024-02-13,Dairy,Cheese,1.0,1.85,1.85,3.41,-1.56,111
2,4657,Corner Grocery,2023-11-23,Bakery,Onions,4.0,7.38,29.52,4.04,25.48,301
3,2679,MegaMart Westside,2025-01-13,Snacks & Candy,Cereal,3.0,5.50,16.50,1.37,15.13,490
4,9935,MegaMart Westside,2023-10-13,Canned Goods,Orange Juice,5.0,8.66,43.30,1.50,41.80,22

In [7]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import text

# List of CREATE TABLE statements
stmt =  """
    CREATE TABLE customers (
        customer_id INT PRIMARY KEY,
        loyalty_points INT
    );
    
    CREATE TABLE stores (
        store_id SERIAL PRIMARY KEY,
        store_name VARCHAR(100) UNIQUE NOT NULL
    );
    
    CREATE TABLE aisles (
        aisle_id SERIAL PRIMARY KEY,
        aisle_name VARCHAR(100) UNIQUE NOT NULL
    );
    
    CREATE TABLE products (
        product_id SERIAL PRIMARY KEY,
        product_name VARCHAR(100) NOT NULL,
        aisle_id INT NOT NULL,
        FOREIGN KEY (aisle_id) REFERENCES aisles(aisle_id)
    );
    
    CREATE TABLE transactions (
        transaction_id SERIAL PRIMARY KEY,
        customer_id INT NOT NULL,
        store_id INT NOT NULL,
        transaction_date DATE NOT NULL,
        FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
        FOREIGN KEY (store_id) REFERENCES stores(store_id)
    );
    
    CREATE TABLE transaction_items (
        item_id SERIAL PRIMARY KEY,
        transaction_id INT NOT NULL,
        product_id INT NOT NULL,
        quantity INT NOT NULL,
        unit_price NUMERIC(10, 2) NOT NULL,
        total_amount NUMERIC(10, 2) NOT NULL,
        discount_amount NUMERIC(10, 2),
        final_amount NUMERIC(10, 2) NOT NULL,
        FOREIGN KEY (transaction_id) REFERENCES transactions(transaction_id),
        FOREIGN KEY (product_id) REFERENCES products(product_id)
    );
    """


# Pass the connection string to a variable, conn_url
conn_url = "postgresql://postgres:123@localhost:5432/my_db"
# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Execute the statement to create tables
with engine.begin() as conn:
    conn.exec_driver_sql(stmt)
print("Your tables were made.")

Your tables were made.

In [8]:
#store df 
import pandas as pd

stores_df = df[['store_name']].drop_duplicates().reset_index(drop=True)
stores_df['store_id'] = range(1, len(stores_df)+1)
stores_df = stores_df[['store_id', 'store_name']]

stores_df.head()

   store_id          store_name
0         1  FreshMart Downtown
1         2      Corner Grocery
2         3   MegaMart Westside
3         4    ValuePlus Market
4         5   GreenGrocer Plaza

In [34]:
#testing insertion for stores 
from sqlalchemy import create_engine

# Connect to PostgreSQL
engine = create_engine("postgresql+psycopg2://postgres:123@localhost:5432/my_db")
stores_df.to_sql(
    name='stores',
    con=engine,
    if_exists='append',
    index=False,
    method='multi'
)

5

In [30]:
#aisle df 
aisles_df = df[['aisle']].drop_duplicates().reset_index(drop=True)
aisles_df['aisle_id'] = range(1, len(aisles_df)+1)
aisles_df = aisles_df[['aisle_id','aisle']].rename(columns={'aisle':'aisle_name'})
aisles_df.head()

   aisle_id      aisle_name
0         1         Produce
1         2           Dairy
2         3          Bakery
3         4  Snacks & Candy
4         5    Canned Goods

In [ ]:
#products were not lining up with aisles so I needed to map it

In [26]:

unique_products = df['product_name'].sort_values().unique()
print("Unique products:", unique_products)


unique_aisles = df['aisle'].sort_values().unique()
print("Unique aisles:", unique_aisles)

Unique products: ['Apples' 'Bananas' 'Bread' 'Carrots' 'Cereal' 'Cheese' 'Chicken Breast'
 'Eggs' 'Ground Beef' 'Milk' 'Onions' 'Orange Juice' 'Pasta' 'Potatoes'
 'Rice' 'Salmon' 'Tomatoes' 'Yogurt']
Unique aisles: ['Bakery' 'Beverages' 'Canned Goods' 'Dairy' 'Frozen Foods'
 'Health & Wellness' 'Household Items' 'Meat & Seafood' 'Personal Care'
 'Produce' 'Snacks & Candy']

In [31]:

product_to_aisle = {
    'Apples': 1,          # Produce
    'Bananas': 1,         # Produce
    'Bread': 3,            # Bakery
    'Carrots': 1,         # Produce
    'Cereal': 5,           # Canned Goods 
    'Cheese': 2,           # Dairy
    'Chicken Breast': 8,   # Meat & Seafood
    'Eggs': 2,             # Dairy
    'Ground Beef': 8,      # Meat & Seafood
    'Milk': 2,             # Dairy
    'Onions': 1,          # Produce
    'Orange Juice': 11,    # Beverages
    'Pasta': 5,            # Canned Goods
    'Potatoes': 1,        # Produce
    'Rice': 4,             # Canned Goods
    'Salmon': 8,           # Meat & Seafood
    'Tomatoes': 1,        # Produce
    'Yogurt': 2            # Dairy
}

In [32]:

products_df['aisle_id'] = products_df['product_name'].map(product_to_aisle)

In [33]:
products_df.head()

   product_id  product_name  aisle_id
0           1         Pasta         5
1           2        Cheese         2
2           3        Onions         1
3           4        Cereal         5
4           5  Orange Juice        11

In [11]:
#create customers_df
customers_df = df[['customer_id']].drop_duplicates().reset_index(drop=True)
if 'loyalty_points' in df.columns:
    customers_df['loyalty_points'] = df['loyalty_points']
else:
    customers_df['loyalty_points'] = 0

customers_df.head()

   customer_id  loyalty_points
0         2824             377
1         5506             111
2         4657             301
3         2679             490
4         9935              22

In [22]:
#transactions df 
transactions_df = df[['customer_id', 'store_id', 'transaction_date']].drop_duplicates().reset_index(drop=True)
transactions_df['transaction_id'] = range(1, len(transactions_df)+1)
transactions_df = transactions_df[['transaction_id', 'customer_id', 'store_id', 'transaction_date']]

transactions_df.head()

   transaction_id  customer_id  store_id transaction_date
0               1         2824         1       2023-08-26
1               2         5506         1       2024-02-13
2               3         4657         2       2023-11-23
3               4         2679         3       2025-01-13
4               5         9935         3       2023-10-13

In [19]:
#had to add store_id to df
df = df.merge(stores_df, on='store_name', how='left')

In [20]:
df.head()

,customer_id,store_name,transaction_date,aisle,product_name,quantity,unit_price,total_amount,discount_amount,final_amount,loyalty_points,store_id
0,2824,FreshMart Downtown,2023-08-26,Produce,Pasta,2.0,7.46,14.92,0.00,14.92,377,1
1,5506,FreshMart Downtown,2024-02-13,Dairy,Cheese,1.0,1.85,1.85,3.41,-1.56,111,1
2,4657,Corner Grocery,2023-11-23,Bakery,Onions,4.0,7.38,29.52,4.04,25.48,301,2
3,2679,MegaMart Westside,2025-01-13,Snacks & Candy,Cereal,3.0,5.50,16.50,1.37,15.13,490,3
4,9935,MegaMart Westside,2023-10-13,Canned Goods,Orange Juice,5.0,8.66,43.30,1.50,41.80,22,3

In [25]:
#transactions_items df

transaction_items_df = df[[
    'customer_id',
    'store_id',
    'transaction_date',
    'product_name',
    'quantity',
    'unit_price',
    'total_amount',
    'discount_amount',
    'final_amount'
]]

# Map transaction_id correctly
transaction_items_df = transaction_items_df.merge(
    transactions_df,
    on=['customer_id', 'store_id', 'transaction_date'],
    how='left'
)

# Map product_id
transaction_items_df = transaction_items_df.merge(
    products_df[['product_id', 'product_name']],
    on='product_name',
    how='left'
)

transaction_items_df['item_id'] = range(1, len(transaction_items_df)+1)

transaction_items_df = transaction_items_df[[
    'item_id',
    'transaction_id',
    'product_id',
    'quantity',
    'unit_price',
    'total_amount',
    'discount_amount',
    'final_amount'
]]

transaction_items_df.head()

,item_id,transaction_id,product_id,quantity,unit_price,total_amount,discount_amount,final_amount
0,1,1,1,2.0,7.46,14.92,0.0,14.92
1,2,1,29,2.0,7.46,14.92,0.0,14.92
2,3,1,34,2.0,7.46,14.92,0.0,14.92
3,4,1,38,2.0,7.46,14.92,0.0,14.92
4,5,1,46,2.0,7.46,14.92,0.0,14.92

In [36]:
#insert tables 
from sqlalchemy import text

with engine.begin() as conn:
    conn.execute(text("""
        TRUNCATE TABLE
            transaction_items,
            transactions,
            products,
            aisles,
            customers
        RESTART IDENTITY CASCADE;
    """))

customers_df.to_sql(name='customers', con=engine, if_exists='append', index=False, method='multi')
aisles_df.to_sql(name='aisles', con=engine, if_exists='append', index=False, method='multi')
products_df.to_sql(name='products', con=engine, if_exists='append', index=False, method='multi')
transactions_df.to_sql(name='transactions', con=engine, if_exists='append', index=False, method='multi')
transaction_items_df.to_sql(name='transaction_items', con=engine, if_exists='append', index=False, method='multi')

21780